IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_cpgmac_tms570ls3x.xml
<?xml version="1.0" encoding="UTF-8"?><module id="ECTL" HW_revision="" XML_version="1" description="Common Platform Gigabit ethernet MAC SubSystem RMII">
     <register id="REVID" acronym="REVID" offset="0x0" width="32" description="Transmit Identification and Version Register ">
<bitfield id="REV" width="32" begin="31" end="0" resetval="1321730304" description="REV ID" range="" rwaccess="R"/>
</register>
     <register id="SOFTRESET" acronym="SOFTRESET" offset="0x4" width="32" description="Software Reset Register">
<bitfield id="_RSVD" width="31" begin="31" end="1" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RESET" width="1" begin="0" end="0" resetval="0" description="Soft Reset for CPGMACSS_R modules INT, REGS, CPPI" range="" rwaccess="RW"/>
</register>
     <register id="INTCONTROL" acronym="INTCONTROL" offset="0xC" width="32" description="Interrupt Control Register">
<bitfield id="_RSVD" width="1" begin="31" end="31" resetval="0" description="Interrupt Test" range="" rwaccess="N"/>
<bitfield id="_RSVD" width="9" begin="30" end="22" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="C2TXPACEEN" width="1" begin="21" end="21" resetval="0" description="C2_TX_PULSE Pacing" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="C2RXPACEEN" width="1" begin="20" end="20" resetval="0" description="C2_RX_PULSE Pacing" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="C1TXPACEEN" width="1" begin="19" end="19" resetval="0" description="C1_TX_PULSE Pacing" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="C1RXPACEEN" width="1" begin="18" end="18" resetval="0" description="C1_RX_PULSE Pacing" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="C0TXPACEEN" width="1" begin="17" end="17" resetval="0" description="C0_TX_PULSE Pacing" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="C0RXPACEEN" width="1" begin="16" end="16" resetval="0" description="C0_RX_PULSE Pacing" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="_RSVD" width="4" begin="15" end="12" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="INTPRESCALE" width="12" begin="11" end="0" resetval="0" description="Interrupt Counter Prescaler (Number of 4us VBUSP_CLKs)" range="" rwaccess="RW"/>
</register>
     <register id="C0RXTHRESHEN" acronym="C0RXTHRESHEN" offset="0x10" width="32" description="Core 0 Receive Threshold Enable Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXCH7THRESHEN" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH6THRESHEN" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH5THRESHEN" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH4THRESHEN" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH3THRESHEN" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH2THRESHEN" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH1THRESHEN" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH0THRESHEN" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
</register>
     <register id="C0RXEN" acronym="C0RXEN" offset="0x14" width="32" description="Core 0 Receive Enable Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXCH7EN" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH6EN" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH5EN" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH4EN" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH3EN" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH2EN" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH1EN" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH0EN" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
</register>
