IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_cpgmac_tms570ls3x.xml
     <register id="C0TXEN" acronym="C0TXEN" offset="0x18" width="32" description="Core 0 Transmit Enable Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="TXCH7EN" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for TXCH7EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH6EN" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for TXCH6EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH5EN" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for TXCH5EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH4EN" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for TXCH4EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH3EN" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for TXCH3EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH2EN" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for TXCH2EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH1EN" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for TXCH1EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH0EN" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for TXCH0EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
</register>
     <register id="C0MISCEN" acronym="C0MISCEN" offset="0x1C" width="32" description="Core 0 Misc Interrupt Enable Register">
<bitfield id="_RSVD" width="28" begin="31" end="4" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="STATPENDEN" width="1" begin="3" end="3" resetval="0" description="Status Pending Interrupt" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="HOSTPENDEN" width="1" begin="2" end="2" resetval="0" description="Host Pending Interrupt" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="LINKINT0EN" width="1" begin="1" end="1" resetval="0" description="MDIO LINKINT[0]" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="USERINT0EN" width="1" begin="0" end="0" resetval="0" description="MDIO USERINT[0]" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
</register>
     <register id="C1RXTHRESHEN" acronym="C1RXTHRESHEN" offset="0x20" width="32" description="Core 1 Receive Threshold Enable Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXCH7THRESHEN" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH6THRESHEN" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH5THRESHEN" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH4THRESHEN" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH3THRESHEN" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH2THRESHEN" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH1THRESHEN" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH0THRESHEN" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0THRESH" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
</register>
     <register id="C1RXEN" acronym="C1RXEN" offset="0x24" width="32" description="Core 1 Receive Enable Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXCH7EN" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH6EN" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH5EN" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH4EN" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH3EN" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH2EN" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH1EN" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXCH0EN" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
</register>
     <register id="C1TXEN" acronym="C1TXEN" offset="0x28" width="32" description="Core 1 Transmit Enable Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="TXCH7EN" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for TXCH7EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH6EN" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for TXCH6EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH5EN" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for TXCH5EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH4EN" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for TXCH4EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH3EN" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for TXCH3EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH2EN" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for TXCH2EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH1EN" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for TXCH1EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="TXCH0EN" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for TXCH0EN" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
</register>
