IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_cpgmac_tms570ls3x.xml
     <register id="C0MISCSTAT" acronym="C0MISCSTAT" offset="0x4C" width="32" description="Core 0 Misc Interrupt Status Register">
<bitfield id="_RSVD" width="28" begin="31" end="4" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="STATPENDSTAT" width="1" begin="3" end="3" resetval="0" description="" range="" rwaccess="R"/>
<bitfield id="HOSTPENDSTAT" width="1" begin="2" end="2" resetval="0" description="" range="" rwaccess="R"/>
<bitfield id="LINKINT0STAT" width="1" begin="1" end="1" resetval="0" description="" range="" rwaccess="R"/>
<bitfield id="USERINT0STAT" width="1" begin="0" end="0" resetval="0" description="" range="" rwaccess="R"/>
</register>
     <register id="C1RXTHRESHSTAT" acronym="C1RXTHRESHSTAT" offset="0x50" width="32" description="Core 1 Receive Threshold Status Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXCH7THRESHSTAT" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7THRESH" range="" rwaccess="R"/>
<bitfield id="RXCH6THRESHSTAT" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6THRESH" range="" rwaccess="R"/>
<bitfield id="RXCH5THRESHSTAT" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5THRESH" range="" rwaccess="R"/>
<bitfield id="RXCH4THRESHSTAT" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4THRESH" range="" rwaccess="R"/>
<bitfield id="RXCH3THRESHSTAT" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3THRESH" range="" rwaccess="R"/>
<bitfield id="RXCH2THRESHSTAT" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2THRESH" range="" rwaccess="R"/>
<bitfield id="RXCH1THRESHSTAT" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1THRESH" range="" rwaccess="R"/>
<bitfield id="RXCH0THRESHSTAT" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0THRESH" range="" rwaccess="R"/>
</register>
     <register id="C1RXSTAT" acronym="C1RXSTAT" offset="0x54" width="32" description="Core 1 Receive Status Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXCH7STAT" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7STAT" range="" rwaccess="R"/>
<bitfield id="RXCH6STAT" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6STAT" range="" rwaccess="R"/>
<bitfield id="RXCH5STAT" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5STAT" range="" rwaccess="R"/>
<bitfield id="RXCH4STAT" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4STAT" range="" rwaccess="R"/>
<bitfield id="RXCH3STAT" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3STAT" range="" rwaccess="R"/>
<bitfield id="RXCH2STAT" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2STAT" range="" rwaccess="R"/>
<bitfield id="RXCH1STAT" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1STAT" range="" rwaccess="R"/>
<bitfield id="RXCH0STAT" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0STAT" range="" rwaccess="R"/>
</register>
     <register id="C1TXSTAT" acronym="C1TXSTAT" offset="0x58" width="32" description="Core 1 Transmit Status Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="TXCH7STAT" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for TXCH7STAT" range="" rwaccess="R"/>
<bitfield id="TXCH6STAT" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for TXCH6STAT" range="" rwaccess="R"/>
<bitfield id="TXCH5STAT" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for TXCH5STAT" range="" rwaccess="R"/>
<bitfield id="TXCH4STAT" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for TXCH4STAT" range="" rwaccess="R"/>
<bitfield id="TXCH3STAT" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for TXCH3STAT" range="" rwaccess="R"/>
<bitfield id="TXCH2STAT" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for TXCH2STAT" range="" rwaccess="R"/>
<bitfield id="TXCH1STAT" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for TXCH1STAT" range="" rwaccess="R"/>
<bitfield id="TXCH0STAT" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for TXCH0STAT" range="" rwaccess="R"/>
</register>
     <register id="C1MISCSTAT" acronym="C1MISCSTAT" offset="0x5C" width="32" description="Core 1 Misc Interrupt Status Register">
<bitfield id="_RSVD" width="28" begin="31" end="4" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="STATPENDSTAT" width="1" begin="3" end="3" resetval="0" description="" range="" rwaccess="R"/>
<bitfield id="HOSTPENDSTAT" width="1" begin="2" end="2" resetval="0" description="" range="" rwaccess="R"/>
<bitfield id="LINKINT0STAT" width="1" begin="1" end="1" resetval="0" description="" range="" rwaccess="R"/>
<bitfield id="USERINT0STAT" width="1" begin="0" end="0" resetval="0" description="" range="" rwaccess="R"/>
</register>
     <register id="C2RXTHRESHSTAT" acronym="C2RXTHRESHSTAT" offset="0x60" width="32" description="Core 2 Receive Threshold Status Register">
    <bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
    <bitfield id="RXCH7THRESHSTAT" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7THRESH" range="" rwaccess="R"/>
    <bitfield id="RXCH6THRESHSTAT" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6THRESH" range="" rwaccess="R"/>
    <bitfield id="RXCH5THRESHSTAT" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5THRESH" range="" rwaccess="R"/>
    <bitfield id="RXCH4THRESHSTAT" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4THRESH" range="" rwaccess="R"/>
    <bitfield id="RXCH3THRESHSTAT" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3THRESH" range="" rwaccess="R"/>
    <bitfield id="RXCH2THRESHSTAT" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2THRESH" range="" rwaccess="R"/>
    <bitfield id="RXCH1THRESHSTAT" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1THRESH" range="" rwaccess="R"/>
    <bitfield id="RXCH0THRESHSTAT" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0THRESH" range="" rwaccess="R"/>
  </register>
