IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_cpgmac_tms570ls3x.xml
     <register id="C2RXSTAT" acronym="C2RXSTAT" offset="0x64" width="32" description="Core 2 Receive Status Register">
    <bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
    <bitfield id="RXCH7STAT" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for RXCH7STAT" range="" rwaccess="R"/>
    <bitfield id="RXCH6STAT" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for RXCH6STAT" range="" rwaccess="R"/>
    <bitfield id="RXCH5STAT" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for RXCH5STAT" range="" rwaccess="R"/>
    <bitfield id="RXCH4STAT" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for RXCH4STAT" range="" rwaccess="R"/>
    <bitfield id="RXCH3STAT" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for RXCH3STAT" range="" rwaccess="R"/>
    <bitfield id="RXCH2STAT" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for RXCH2STAT" range="" rwaccess="R"/>
    <bitfield id="RXCH1STAT" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for RXCH1STAT" range="" rwaccess="R"/>
    <bitfield id="RXCH0STAT" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for RXCH0STAT" range="" rwaccess="R"/>
  </register>
     <register id="C2TXSTAT" acronym="C2TXSTAT" offset="0x68" width="32" description="Core 2 Transmit Status Register">
    <bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="" range="" rwaccess="N"/>
    <bitfield id="TXCH7STAT" width="1" begin="7" end="7" resetval="0" description="Corresponds to the interrupt for TXCH7STAT" range="" rwaccess="R"/>
    <bitfield id="TXCH6STAT" width="1" begin="6" end="6" resetval="0" description="Corresponds to the interrupt for TXCH6STAT" range="" rwaccess="R"/>
    <bitfield id="TXCH5STAT" width="1" begin="5" end="5" resetval="0" description="Corresponds to the interrupt for TXCH5STAT" range="" rwaccess="R"/>
    <bitfield id="TXCH4STAT" width="1" begin="4" end="4" resetval="0" description="Corresponds to the interrupt for TXCH4STAT" range="" rwaccess="R"/>
    <bitfield id="TXCH3STAT" width="1" begin="3" end="3" resetval="0" description="Corresponds to the interrupt for TXCH3STAT" range="" rwaccess="R"/>
    <bitfield id="TXCH2STAT" width="1" begin="2" end="2" resetval="0" description="Corresponds to the interrupt for TXCH2STAT" range="" rwaccess="R"/>
    <bitfield id="TXCH1STAT" width="1" begin="1" end="1" resetval="0" description="Corresponds to the interrupt for TXCH1STAT" range="" rwaccess="R"/>
    <bitfield id="TXCH0STAT" width="1" begin="0" end="0" resetval="0" description="Corresponds to the interrupt for TXCH0STAT" range="" rwaccess="R"/>
  </register>
     <register id="C2MISCSTAT" acronym="C2MISCSTAT" offset="0x6C" width="32" description="Core 2 Misc Interrupt Status Register">
    <bitfield id="_RSVD" width="28" begin="31" end="4" resetval="0" description="" range="" rwaccess="N"/>
    <bitfield id="STATPENDSTAT" width="1" begin="3" end="3" resetval="0" description="" range="" rwaccess="R"/>
    <bitfield id="HOSTPENDSTAT" width="1" begin="2" end="2" resetval="0" description="" range="" rwaccess="R"/>
    <bitfield id="LINKINT0STAT" width="1" begin="1" end="1" resetval="0" description="" range="" rwaccess="R"/>
    <bitfield id="USERINT0STAT" width="1" begin="0" end="0" resetval="0" description="" range="" rwaccess="R"/>
  </register>
     <register id="C0RXIMAX" acronym="C0RXIMAX" offset="0x70" width="32" description="Core 0 Receive Interrupts per Millisecond Register">
<bitfield id="_RSVD" width="26" begin="31" end="6" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXIMAX" width="6" begin="5" end="0" resetval="0" description="Core 0 Receive Interrupts per Millisecond for C0RXPULSE" range="" rwaccess="RW"/>
</register>
     <register id="C0TXIMAX" acronym="C0TXIMAX" offset="0x74" width="32" description="Core 0 Transmit Interrupts per Millisecond Register">
<bitfield id="_RSVD" width="26" begin="31" end="6" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="TXIMAX" width="6" begin="5" end="0" resetval="0" description="Core 0 Receive Interrupts per Millisecond for C0TXPULSE" range="" rwaccess="RW"/>
</register>
     <register id="C1RXIMAX" acronym="C1RXIMAX" offset="0x78" width="32" description="Core 1 Receive Interrupts per Millisecond Register">
<bitfield id="_RSVD" width="26" begin="31" end="6" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXIMAX" width="6" begin="5" end="0" resetval="0" description="Core 1 Receive Interrupts per Millisecond for C1RXPULSE" range="" rwaccess="RW"/>
</register>
     <register id="C1TXIMAX" acronym="C1TXIMAX" offset="0x7C" width="32" description="Core 1 Transmit Interrupts per Millisecond Register">
<bitfield id="_RSVD" width="26" begin="31" end="6" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="TXIMAX" width="6" begin="5" end="0" resetval="0" description="Core 1 Receive Interrupts per Millisecond for C1TXPULSE" range="" rwaccess="RW"/>
</register>
     <register id="C2RXIMAX" acronym="C2RXIMAX" offset="0x80" width="32" description="Core 2 Receive Interrupts per Millisecond Register">
    <bitfield id="_RSVD" width="26" begin="31" end="6" resetval="0" description="" range="" rwaccess="N"/>
    <bitfield id="RXIMAX" width="6" begin="5" end="0" resetval="0" description="Core 1 Receive Interrupts per Millisecond for C1RXPULSE" range="" rwaccess="RW"/>
  </register>
     <register id="C2TXIMAX" acronym="C2TXIMAX" offset="0x84" width="32" description="Core 2 Transmit Interrupts per Millisecond Register">
    <bitfield id="_RSVD" width="26" begin="31" end="6" resetval="0" description="" range="" rwaccess="N"/>
    <bitfield id="TXIMAX" width="6" begin="5" end="0" resetval="0" description="Core 1 Receive Interrupts per Millisecond for C1TXPULSE" range="" rwaccess="RW"/>
  </register>
</module>
